[M_LostTreasure MissionDefinition]
MissionName="Property found"
MissionDescription="They found part of the treasure map. There's only one thing you can do: start killing criminals until you find pieces and combine them to find the treasure. Well, there are three things, but you get the idea. "
TurnInDescription="I found a hidden treasure! you are stupid."
MissionSummary="Find the lost treasure in the old harbor.."
MissionGiver="Stereo"
MissionTurnInLocation="Money is wasted"
TeaserText="Here! Housing map!"

[M_LostTreasure:AccessTopFloor MissionObjectiveDefinition]
ProgressMessage="Go to the puzzle"

[M_LostTreasure:AccessTopFloorSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_LostTreasure:CollectHintsSet MissionObjectiveSetCollectionDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_LostTreasure:CollectTreasure MissionObjectiveDefinition]
ProgressMessage="buy goods"

[M_LostTreasure:CollectTreasureSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_LostTreasure:FindClues MissionObjectiveDefinition]
ProgressMessage="save resources"

[M_LostTreasure:FindHint2 MissionObjectiveDefinition]
ProgressMessage="Look for other links."

[M_LostTreasure:FindHint3 MissionObjectiveDefinition]
ProgressMessage="Find the third point"

[M_LostTreasure:FindHint4 MissionObjectiveDefinition]
ProgressMessage="Get the fourth clue"

[M_LostTreasure:FollowtheClues MissionObjectiveDefinition]
ProgressMessage="Follow the instructions"

[M_LostTreasure:FollowTheCluesSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Once all the treasure maps are found, you can follow the instructions to find the treasure. [place]this is hot water[-place]."

[M_LostTreasure:Hint1Reveal MissionObjectiveDefinition]
ProgressMessage="under acid"

[M_LostTreasure:Hint2Reveal MissionObjectiveDefinition]
ProgressMessage="Sleeping on the beach."

[M_LostTreasure:Hint3Reveal MissionObjectiveDefinition]
ProgressMessage="my shadow"

[M_LostTreasure:Hint3Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_LostTreasure:Hint4Reveal MissionObjectiveDefinition]
ProgressMessage="There are still six months of blood left."

[M_LostTreasure:Hint4Set MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_LostTreasure:LocateTreasure MissionObjectiveDefinition]
ProgressMessage="find the treasure"

[M_LostTreasure:LocateTreasureSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_LostTreasure:RevealHint2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_LostTreasure:RevealHint3 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_LostTreasure:RevealHint4 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

